tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register>
          <name>SHSR2</name>
          <displayName>SHSR2</displayName>
          <description>DAC Sample and Hold sample time register
          2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAMPLE2</name>
              <description>DAC Channel 2 sample Time (only valid in
              sample &amp;amp; hold mode) These bits can be written
              when the DAC channel2 is disabled or also during
              normal operation. in the latter case, the write can
              be done only when BWSTx of DAC_SR register is low, if
              BWSTx=1, the write operation is
              ignored.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHHR</name>
          <displayName>SHHR</displayName>
          <description>DAC Sample and Hold hold time
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>THOLD1</name>
              <description>DAC Channel 1 hold Time (only valid in
              sample &amp;amp; hold mode) Hold time= (THOLD[9:0]) x
              T LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>THOLD2</name>
              <description>DAC Channel 2 hold time (only valid in
              sample &amp;amp; hold mode). Hold time= (THOLD[9:0])
              x T LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SHRR</name>
          <displayName>SHRR</displayName>
          <description>DAC Sample and Hold refresh time
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00010001</resetValue>
          <fields>
            <field>
              <name>TREFRESH1</name>
              <description>DAC Channel 1 refresh Time (only valid
              in sample &amp;amp; hold mode) Refresh time=
              (TREFRESH[7:0]) x T LSI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TREFRESH2</name>
              <description>DAC Channel 2 refresh Time (only valid
              in sample &amp;amp; hold mode) Refresh time=
              (TREFRESH[7:0]) x T LSI</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BDMA</name>
      <description>BDMA</description>
      <groupName>BDMA</groupName>
      <baseAddress>0x58025400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BDMA_CH1</name>
        <description>BDMA channel 1 interrupt</description>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH2</name>
        <description>BDMA channel 2 interrupt</description>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH3</name>
        <description>BDMA channel 3 interrupt</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH4</name>
        <description>BDMA channel 4 interrupt</description>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH5</name>
        <description>BDMA channel 5 interrupt</description>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH6</name>
        <description>BDMA channel 6 interrupt</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH7</name>
        <description>BDMA channel 7 interrupt</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>BDMA_CH8</name>
        <description>BDMA channel 8 interrupt</description>
        <value>136</value>
      </interrupt>
      <registers>
        <cluster><dim>8</dim><dimIncrement>0x14</dimIncrement><dimIndex>0,1,2,3,4,5,6,7</dimIndex><name>CH%s</name><description>Channel cluster: CCR?, CNDTR?, CPAR?, CM0AR? and CM1AR? registers</description><addressOffset>0x8</addressOffset><register>
          <name>CR</name>
          <displayName>CCR1</displayName>
          <description>DMA channel x configuration
          register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel enable This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer complete interrupt enable This
              bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TCIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TC interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TC interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HTIE</name>
              <description>Half transfer interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>HT interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>HT interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer error interrupt enable This bit
              is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TEIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>TE interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>TE interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Data transfer direction This bit is set
              and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DIR</name><usage>read-write</usage><enumeratedValue><name>PeripheralToMemory</name><description>Peripheral-to-memory</description><value>0</value></enumeratedValue><enumeratedValue><name>MemoryToPeripheral</name><description>Memory-to-peripheral</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular mode This bit is set and
              cleared by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CIRC</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Circular mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Circular mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral increment mode This bit is
              set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PINC</name><usage>read-write</usage><enumeratedValue><name>Fixed</name><description>Address pointer is fixed</description><value>0</value></enumeratedValue><enumeratedValue><name>Incremented</name><description>Address pointer is incremented after each data transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory increment mode This bit is set
              and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="PINC"/>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral size These bits are set and
              cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PSIZE</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>Byte (8-bit)</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>Half-word (16-bit)</description><value>1</value></enumeratedValue><enumeratedValue><name>Bits32</name><description>Word (32-bit)</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory size These bits are set and
              cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="PSIZE"/>
            </field>
            <field>
              <name>PL</name>
              <description>Channel priority level These bits are
              set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PL</name><usage>read-write</usage><enumeratedValue><name>Low</name><description>Low</description><value>0</value></enumeratedValue><enumeratedValue><name>Medium</name><description>Medium</description><value>1</value></enumeratedValue><enumeratedValue><name>High</name><description>High</description><value>2</value></enumeratedValue><enumeratedValue><name>VeryHigh</name><description>Very high</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory to memory mode This bit is set
              and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MEM2MEM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Memory-to-memory mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Memory-to-memory mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          <field><name>CT</name><description>Current target memory in double-buffer mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>CT</name><usage>read-write</usage><enumeratedValue><name>Memory0</name><description>The current target memory is Memory 0</description><value>0</value></enumeratedValue><enumeratedValue><name>Memory1</name><description>The current target memory is Memory 1</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>DBM</name><description>Double-buffer mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>DBM</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No buffer switching at the end of transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Memory target switched at the end of the DMA transfer</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>NDTR</name>
          <displayName>CNDTR1</displayName>
          <description>DMA channel x number of data
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of data to transfer Number of
              data to be transferred (0 up to 65535). This register
              can only be written when the channel is disabled.
              Once the channel is enabled, this register is
              read-only, indicating the remaining bytes to be
              transmitted. This register decrements after each DMA
              transfer. Once the transfer is completed, this
              register can either stay at zero or be reloaded
              automatically by the value previously programmed if
              the channel is configured in auto-reload mode. If
              this register is zero, no transaction can be served
              whether the channel is enabled or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PAR</name>
          <displayName>CPAR1</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral address Base address of the
              peripheral data register from/to which the data will
              be read/written. When PSIZE is 01 (16-bit), the PA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When PSIZE is 10 (32-bit), PA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>M0AR</name>
          <displayName>CMAR1</displayName>
          <description>This register must not be written when the
          channel is enabled.</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory address Base address of the
              memory area from/to which the data will be
              read/written. When MSIZE is 01 (16-bit), the MA[0]
              bit is ignored. Access is automatically aligned to a
              half-word address. When MSIZE is 10 (32-bit), MA[1:0]
              are ignored. Access is automatically aligned to a
              word address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
