tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register><name>M1AR</name><description>Channel x memory 1 address register</description><addressOffset>0x10</addressOffset><access>read-write</access><resetValue>0</resetValue><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        </cluster><register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>DMA interrupt status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GIF1</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>GIF1</name><usage>read-write</usage><enumeratedValue><name>NoEvent</name><description>No TE, HT or TC event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>A TE, HT or TC event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TCIF1</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TCIF1</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>No transfer complete event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>A transfer complete event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>HTIF1</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>HTIF1</name><usage>read-write</usage><enumeratedValue><name>NotHalf</name><description>No half transfer event on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Half</name><description>A half transfer event occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TEIF1</name><usage>read-write</usage><enumeratedValue><name>NoError</name><description>No transfer error on channel x</description><value>0</value></enumeratedValue><enumeratedValue><name>Error</name><description>A transfer error occurred on channel x</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>GIF2</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF2</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF3</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF3</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF4</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF4</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF4</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF4</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF5</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF5</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF5</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF5</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF6</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF6</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF6</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF6</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF7</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF7</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF7</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF7</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
            <field>
              <name>GIF8</name>
              <description>Channel x global interrupt flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="GIF1"/>
            </field>
            <field>
              <name>TCIF8</name>
              <description>Channel x transfer complete flag (x =
              1..8) This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TCIF1"/>
            </field>
            <field>
              <name>HTIF8</name>
              <description>Channel x half transfer flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="HTIF1"/>
            </field>
            <field>
              <name>TEIF8</name>
              <description>Channel x transfer error flag (x = 1..8)
              This bit is set by hardware. It is cleared by
              software writing 1 to the corresponding bit in the
              DMA_IFCR register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="TEIF1"/>
            </field>
          </fields>
        </register>
