tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register>
          <name>IFCR</name>
          <displayName>IFCR</displayName>
          <description>DMA interrupt flag clear
          register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CGIF1</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CGIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding CGIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTCIF1</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTCIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding TCIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CHTIF1</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CHTIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding HTIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CTEIF1</name><usage>read-write</usage><enumeratedValue><name>Clear</name><description>Clear the corresponding TEIFx flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CGIF2</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF2</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF3</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF3</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF4</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF4</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF4</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF4</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF5</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF5</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF5</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF5</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF6</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF6</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF6</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF6</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF7</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF7</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF7</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF7</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
            <field>
              <name>CGIF8</name>
              <description>Channel x global interrupt clear This
              bit is set and cleared by software.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CGIF1"/>
            </field>
            <field>
              <name>CTCIF8</name>
              <description>Channel x transfer complete clear This
              bit is set and cleared by software.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTCIF1"/>
            </field>
            <field>
              <name>CHTIF8</name>
              <description>Channel x half transfer clear This bit
              is set and cleared by software.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CHTIF1"/>
            </field>
            <field>
              <name>CTEIF8</name>
              <description>Channel x transfer error clear This bit
              is set and cleared by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="CTEIF1"/>
            </field>
          </fields>
        </register>
