tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register>
          <name>TXDR</name>
          <displayName>TXDR</displayName>
          <description>Access: No wait states</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>8-bit transmit data Data byte to be
              transmitted to the I2C bus. Note: These bits can be
              written only when TXE=1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 event interrupt</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 error interrupt</description>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <baseAddress>0x40005C00</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>73</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <baseAddress>0x58001C00</baseAddress>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>96</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x58020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>GPIO port mode register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xABFFFFFF</resetValue>
          <fields>
            <field>
              <name>MODER0</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MODER0</name><usage>read-write</usage><enumeratedValue><name>Input</name><description>Input mode (reset state)</description><value>0</value></enumeratedValue><enumeratedValue><name>Output</name><description>General purpose output mode</description><value>1</value></enumeratedValue><enumeratedValue><name>Alternate</name><description>Alternate function mode</description><value>2</value></enumeratedValue><enumeratedValue><name>Analog</name><description>Analog mode</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MODER1</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER2</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER3</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER4</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER5</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER6</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER7</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER8</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER9</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER10</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER11</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER12</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER13</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER14</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
            <field>
              <name>MODER15</name>
              <description>[1:0]: Port x configuration bits (y =
              0..15) These bits are written by software to
              configure the I/O mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues derivedFrom="MODER0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>GPIO port output type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT0</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OT0</name><usage>read-write</usage><enumeratedValue><name>PushPull</name><description>Output push-pull (reset state)</description><value>0</value></enumeratedValue><enumeratedValue><name>OpenDrain</name><description>Output open-drain</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT8</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT9</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT10</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT11</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT12</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT13</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT14</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT15</name>
              <description>Port x configuration bits (y = 0..15)
              These bits are written by software to configure the
              I/O output type.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OT0"/>
            </field>
          </fields>
        </register>
