tinygo-org/stm32-svd/svd/stm32h747cm7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x58004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC_TAMP_STAMP_CSS_LSE</name>
        <description>RTC tamper, timestamp</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>RTC_WKUP</name>
        <description>RTC Wakeup interrupt</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>RTC_ALARM</name>
        <description>RTC alarms (A and B)</description>
        <value>41</value>
      </interrupt>
      <registers>
        <register>
          <name>TR</name>
          <displayName>TR</displayName>
          <description>The RTC_TR is the calendar time shadow
          register. This register must be written in initialization
          mode only. Refer to Calendar initialization and
          configuration on page9 and Reading the calendar on
          page10.This register is write protected. The write access
          procedure is described in RTC register write protection
          on page9.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SU</name>
              <description>Second units in BCD format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ST</name>
              <description>Second tens in BCD format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MNU</name>
              <description>Minute units in BCD format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MNT</name>
              <description>Minute tens in BCD format</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
            <field>
              <name>HU</name>
              <description>Hour units in BCD format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>HT</name>
              <description>Hour tens in BCD format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
            <field>
              <name>PM</name>
              <description>AM/PM notation</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PM</name><usage>read-write</usage><enumeratedValue><name>AM</name><description>AM or 24-hour format</description><value>0</value></enumeratedValue><enumeratedValue><name>PM</name><description>PM</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>The RTC_DR is the calendar date shadow
          register. This register must be written in initialization
          mode only. Refer to Calendar initialization and
          configuration on page9 and Reading the calendar on
          page10.This register is write protected. The write access
          procedure is described in RTC register write protection
          on page9.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002101</resetValue>
          <fields>
            <field>
              <name>DU</name>
              <description>Date units in BCD format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DT</name>
              <description>Date tens in BCD format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MU</name>
              <description>Month units in BCD format</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MT</name>
              <description>Month tens in BCD format</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>1</maximum></range></writeConstraint>
            </field>
            <field>
              <name>WDU</name>
              <description>Week day units</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>7</maximum></range></writeConstraint>
            </field>
            <field>
              <name>YU</name>
              <description>Year units in BCD format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>YT</name>
              <description>Year tens in BCD format</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>RTC control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WUCKSEL</name>
              <description>Wakeup clock selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>WUCKSEL</name><usage>read-write</usage><enumeratedValue><name>Div16</name><description>RTC/16 clock is selected</description><value>0</value></enumeratedValue><enumeratedValue><name>Div8</name><description>RTC/8 clock is selected</description><value>1</value></enumeratedValue><enumeratedValue><name>Div4</name><description>RTC/4 clock is selected</description><value>2</value></enumeratedValue><enumeratedValue><name>Div2</name><description>RTC/2 clock is selected</description><value>3</value></enumeratedValue><enumeratedValue><name>ClockSpare</name><description>ck_spre (usually 1 Hz) clock is selected</description><value>4</value></enumeratedValue><enumeratedValue><name>ClockSpareWithOffset</name><description>ck_spre (usually 1 Hz) clock is selected and 2^16 is added to the WUT counter value</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSEDGE</name>
              <description>Time-stamp event active edge TSE must be
              reset when TSEDGE is changed to avoid unwanted TSF
              setting.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSEDGE</name><usage>read-write</usage><enumeratedValue><name>RisingEdge</name><description>RTC_TS input rising edge generates a time-stamp event</description><value>0</value></enumeratedValue><enumeratedValue><name>FallingEdge</name><description>RTC_TS input falling edge generates a time-stamp event</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>REFCKON</name>
              <description>RTC_REFIN reference clock detection
              enable (50 or 60Hz) Note: PREDIV_S must be
              0x00FF.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>REFCKON</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>RTC_REFIN detection disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>RTC_REFIN detection enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BYPSHAD</name>
              <description>Bypass the shadow registers Note: If the
              frequency of the APB clock is less than seven times
              the frequency of RTCCLK, BYPSHAD must be set to
              1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>BYPSHAD</name><usage>read-write</usage><enumeratedValue><name>ShadowReg</name><description>Calendar values (when reading from RTC_SSR, RTC_TR, and RTC_DR) are taken from the shadow registers, which are updated once every two RTCCLK cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>BypassShadowReg</name><description>Calendar values (when reading from RTC_SSR, RTC_TR, and RTC_DR) are taken directly from the calendar counters</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FMT</name>
              <description>Hour format</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FMT</name><usage>read-write</usage><enumeratedValue><name>Twenty_Four_Hour</name><description>24 hour/day format</description><value>0</value></enumeratedValue><enumeratedValue><name>AM_PM</name><description>AM/PM hour format</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRAE</name>
              <description>Alarm A enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRAE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm A disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm A enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRBE</name>
              <description>Alarm B enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRBE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm B disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm B enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WUTE</name>
              <description>Wakeup timer enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>WUTE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wakeup timer disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wakeup timer enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSE</name>
              <description>timestamp enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Timestamp disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Timestamp enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRAIE</name>
              <description>Alarm A interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRAIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm A interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm A interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ALRBIE</name>
              <description>Alarm B interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ALRBIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Alarm B Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Alarm B Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WUTIE</name>
              <description>Wakeup timer interrupt
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>WUTIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wakeup timer interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wakeup timer interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSIE</name>
              <description>Time-stamp interrupt
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>TSIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Time-stamp Interrupt disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Time-stamp Interrupt enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADD1H</name>
              <description>Add 1 hour (summer time change) When
              this bit is set outside initialization mode, 1 hour
              is added to the calendar time. This bit is always
              read as 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            <enumeratedValues><name>ADD1HW</name><usage>write</usage><enumeratedValue><name>Add1</name><description>Adds 1 hour to the current time. This can be used for summer time change outside initialization mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SUB1H</name>
              <description>Subtract 1 hour (winter time change)
              When this bit is set outside initialization mode, 1
              hour is subtracted to the calendar time if the
              current hour is not 0. This bit is always read as 0.
              Setting this bit has no effect when current hour is
              0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            <enumeratedValues><name>SUB1HW</name><usage>write</usage><enumeratedValue><name>Sub1</name><description>Subtracts 1 hour to the current time. This can be used for winter time change outside initialization mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BKP</name>
              <description>Backup This bit can be written by the
              user to memorize whether the daylight saving time
              change has been performed or not.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>BKP</name><usage>read-write</usage><enumeratedValue><name>DST_Not_Changed</name><description>Daylight Saving Time change has not been performed</description><value>0</value></enumeratedValue><enumeratedValue><name>DST_Changed</name><description>Daylight Saving Time change has been performed</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COSEL</name>
              <description>Calibration output selection When COE=1,
              this bit selects which signal is output on RTC_CALIB.
              These frequencies are valid for RTCCLK at 32.768 kHz
              and prescalers at their default values (PREDIV_A=127
              and PREDIV_S=255). Refer to Section24.3.15:
              Calibration clock output</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>COSEL</name><usage>read-write</usage><enumeratedValue><name>CalFreq_512Hz</name><description>Calibration output is 512 Hz (with default prescaler setting)</description><value>0</value></enumeratedValue><enumeratedValue><name>CalFreq_1Hz</name><description>Calibration output is 1 Hz (with default prescaler setting)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>POL</name>
              <description>Output polarity This bit is used to
              configure the polarity of RTC_ALARM
              output</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>POL</name><usage>read-write</usage><enumeratedValue><name>High</name><description>The pin is high when ALRAF/ALRBF/WUTF is asserted (depending on OSEL[1:0])</description><value>0</value></enumeratedValue><enumeratedValue><name>Low</name><description>The pin is low when ALRAF/ALRBF/WUTF is asserted (depending on OSEL[1:0])</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OSEL</name>
              <description>Output selection These bits are used to
              select the flag to be routed to RTC_ALARM
              output</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>OSEL</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>AlarmA</name><description>Alarm A output enabled</description><value>1</value></enumeratedValue><enumeratedValue><name>AlarmB</name><description>Alarm B output enabled</description><value>2</value></enumeratedValue><enumeratedValue><name>Wakeup</name><description>Wakeup output enabled</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COE</name>
              <description>Calibration output enable This bit
              enables the RTC_CALIB output</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>COE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Calibration output disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Calibration output enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ITSE</name>
              <description>timestamp on internal event
              enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ITSE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Internal event timestamp is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Internal event timestamp is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
