tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        </registers>
    </peripheral>
    <peripheral>
      <name>SAI4</name>
      <description>SAI</description>
      <groupName>SAI</groupName>
      <baseAddress>0x58005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SAI4</name>
        <description>SAI4 global interrupt</description>
        <value>146</value>
      </interrupt>
      <registers>
        <cluster><dim>2</dim><dimIncrement>0x20</dimIncrement><dimIndex>A,B</dimIndex><name>CH%s</name><description>Cluster CH%s, containing ?CR1, ?CR2, ?FRCR, ?SLOTR, ?IM, ?SR, ?CLRFR, ?DR</description><addressOffset>0x4</addressOffset><register>
          <name>CR1</name>
          <displayName>ACR1</displayName>
          <description>Configuration register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>SAIx audio block mode
              immediately</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MODE</name><usage>read-write</usage><enumeratedValue><name>MasterTx</name><description>Master transmitter</description><value>0</value></enumeratedValue><enumeratedValue><name>MasterRx</name><description>Master receiver</description><value>1</value></enumeratedValue><enumeratedValue><name>SlaveTx</name><description>Slave transmitter</description><value>2</value></enumeratedValue><enumeratedValue><name>SlaveRx</name><description>Slave receiver</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRTCFG</name>
              <description>Protocol configuration. These bits are
              set and cleared by software. These bits have to be
              configured when the audio block is
              disabled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PRTCFG</name><usage>read-write</usage><enumeratedValue><name>Free</name><description>Free protocol. Free protocol allows to use the powerful configuration of the audio block to address a specific audio protocol</description><value>0</value></enumeratedValue><enumeratedValue><name>Spdif</name><description>SPDIF protocol</description><value>1</value></enumeratedValue><enumeratedValue><name>Ac97</name><description>AC&#8217;97 protocol</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DS</name>
              <description>Data size. These bits are set and
              cleared by software. These bits are ignored when the
              SPDIF protocols are selected (bit PRTCFG[1:0]),
              because the frame and the data size are fixed in such
              case. When the companding mode is selected through
              COMP[1:0] bits, DS[1:0] are ignored since the data
              size is fixed to 8 bits by the algorithm. These bits
              must be configured when the audio block is
              disabled.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>DS</name><usage>read-write</usage><enumeratedValue><name>Bit8</name><description>8 bits</description><value>2</value></enumeratedValue><enumeratedValue><name>Bit10</name><description>10 bits</description><value>3</value></enumeratedValue><enumeratedValue><name>Bit16</name><description>16 bits</description><value>4</value></enumeratedValue><enumeratedValue><name>Bit20</name><description>20 bits</description><value>5</value></enumeratedValue><enumeratedValue><name>Bit24</name><description>24 bits</description><value>6</value></enumeratedValue><enumeratedValue><name>Bit32</name><description>32 bits</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>Least significant bit first. This bit is
              set and cleared by software. It must be configured
              when the audio block is disabled. This bit has no
              meaning in AC97 audio protocol since AC97 data are
              always transferred with the MSB first. This bit has
              no meaning in SPDIF audio protocol since in SPDIF
              data are always transferred with LSB
              first.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSBFIRST</name><usage>read-write</usage><enumeratedValue><name>MsbFirst</name><description>Data are transferred with MSB first</description><value>0</value></enumeratedValue><enumeratedValue><name>LsbFirst</name><description>Data are transferred with LSB first</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKSTR</name>
              <description>Clock strobing edge. This bit is set and
              cleared by software. It must be configured when the
              audio block is disabled. This bit has no meaning in
              SPDIF audio protocol.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CKSTR</name><usage>read-write</usage><enumeratedValue><name>FallingEdge</name><description>Data strobing edge is falling edge of SCK</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Data strobing edge is rising edge of SCK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable. These bits are
              set and cleared by software. They must be configured
              when the audio sub-block is disabled. Note: The audio
              sub-block should be configured as asynchronous when
              SPDIF mode is enabled.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>SYNCEN</name><usage>read-write</usage><enumeratedValue><name>Asynchronous</name><description>audio sub-block in asynchronous mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Internal</name><description>audio sub-block is synchronous with the other internal audio sub-block. In this case, the audio sub-block must be configured in slave mode</description><value>1</value></enumeratedValue><enumeratedValue><name>External</name><description>audio sub-block is synchronous with an external SAI embedded peripheral. In this case the audio sub-block should be configured in Slave mode</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MONO</name>
              <description>Mono mode. This bit is set and cleared
              by software. It is meaningful only when the number of
              slots is equal to 2. When the mono mode is selected,
              slot 0 data are duplicated on slot 1 when the audio
              block operates as a transmitter. In reception mode,
              the slot1 is discarded and only the data received
              from slot 0 are stored. Refer to Section: Mono/stereo
              mode for more details.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MONO</name><usage>read-write</usage><enumeratedValue><name>Stereo</name><description>Stereo mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Mono</name><description>Mono mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OUTDRIV</name>
              <description>Output drive. This bit is set and
              cleared by software. Note: This bit has to be set
              before enabling the audio block and after the audio
              block configuration.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OUTDRIV</name><usage>read-write</usage><enumeratedValue><name>OnStart</name><description>Audio block output driven when SAIEN is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Immediately</name><description>Audio block output driven immediately after the setting of this bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAIEN</name>
              <description>Audio block enable where x is A or B.
              This bit is set by software. To switch off the audio
              block, the application software must program this bit
              to 0 and poll the bit till it reads back 0, meaning
              that the block is completely disabled. Before setting
              this bit to 1, check that it is set to 0, otherwise
              the enable command will not be taken into account.
              This bit allows to control the state of SAIx audio
              block. If it is disabled when an audio frame transfer
              is ongoing, the ongoing transfer completes and the
              cell is fully disabled at the end of this audio frame
              transfer. Note: When SAIx block is configured in
              master mode, the clock must be present on the input
              of SAIx before setting SAIXEN bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SAIEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SAI audio block disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SAI audio block enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable. This bit is set and cleared
              by software. Note: Since the audio block defaults to
              operate as a transmitter after reset, the MODE[1:0]
              bits must be configured before setting DMAEN to avoid
              a DMA request in receiver mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MCKDIV</name>
              <description>Master clock divider. These bits are set
              and cleared by software. These bits are meaningless
              when the audio block operates in slave mode. They
              have to be configured when the audio block is
              disabled. Others: the master clock frequency is
              calculated accordingly to the following
              formula:</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>OSR</name>
              <description>Oversampling ratio for master
              clock</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field><name>NODIV</name><description>No fixed divider between MCLK and FS</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><enumeratedValues><name>NODIV</name><usage>read-write</usage><enumeratedValue><name>MasterClock</name><description>MCLK output is enabled. Forces the ratio between FS and MCLK to 256 or 512 according to the OSR value</description><value>0</value></enumeratedValue><enumeratedValue><name>NoDiv</name><description>MCLK output enable set by the MCKEN bit (where present, else 0). Ratio between FS and MCLK depends on FRL.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field><name>MCKEN</name><description>Master clock generation enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>ACR2</displayName>
          <description>Configuration register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FTH</name>
              <description>FIFO threshold. This bit is set and
              cleared by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FTH</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter1</name><description>1&#8260;4 FIFO</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1&#8260;2 FIFO</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>3&#8260;4 FIFO</description><value>3</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO full</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>FIFO flush. This bit is set by software.
              It is always read as 0. This bit should be configured
              when the SAI is disabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            <enumeratedValues><name>FFLUSH</name><usage>read-write</usage><enumeratedValue><name>NoFlush</name><description>No FIFO flush</description><value>0</value></enumeratedValue><enumeratedValue><name>Flush</name><description>FIFO flush. Programming this bit to 1 triggers the FIFO Flush. All the internal FIFO pointers (read and write) are cleared</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIS</name>
              <description>Tristate management on data line. This
              bit is set and cleared by software. It is meaningful
              only if the audio block is configured as a
              transmitter. This bit is not used when the audio
              block is configured in SPDIF mode. It should be
              configured when SAI is disabled. Refer to Section:
              Output data line management on an inactive slot for
              more details.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MUTE</name>
              <description>Mute. This bit is set and cleared by
              software. It is meaningful only when the audio block
              operates as a transmitter. The MUTE value is linked
              to value of MUTEVAL if the number of slots is lower
              or equal to 2, or equal to 0 if it is greater than 2.
              Refer to Section: Mute mode for more details. Note:
              This bit is meaningless and should not be used for
              SPDIF audio blocks.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MUTE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No mute mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Mute mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEVAL</name>
              <description>Mute value. This bit is set and cleared
              by software.It must be written before enabling the
              audio block: SAIXEN. This bit is meaningful only when
              the audio block operates as a transmitter, the number
              of slots is lower or equal to 2 and the MUTE bit is
              set. If more slots are declared, the bit value sent
              during the transmission in mute mode is equal to 0,
              whatever the value of MUTEVAL. if the number of slot
              is lower or equal to 2 and MUTEVAL = 1, the MUTE
              value transmitted for each slot is the one sent
              during the previous frame. Refer to Section: Mute
              mode for more details. Note: This bit is meaningless
              and should not be used for SPDIF audio
              blocks.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>MUTEVAL</name><usage>read-write</usage><enumeratedValue><name>SendZero</name><description>Bit value 0 is sent during the mute mode</description><value>0</value></enumeratedValue><enumeratedValue><name>SendLast</name><description>Last values are sent during the mute mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTECNT</name>
              <description>Mute counter. These bits are set and
              cleared by software. They are used only in reception
              mode. The value set in these bits is compared to the
              number of consecutive mute frames detected in
              reception. When the number of mute frames is equal to
              this value, the flag MUTEDET will be set and an
              interrupt will be generated if bit MUTEDETIE is set.
              Refer to Section: Mute mode for more
              details.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPL</name>
              <description>Complement bit. This bit is set and
              cleared by software. It defines the type of
              complement to be used for companding mode Note: This
              bit has effect only when the companding mode is -Law
              algorithm or A-Law algorithm.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>CPL</name><usage>read-write</usage><enumeratedValue><name>OnesComplement</name><description>1&#8217;s complement representation</description><value>0</value></enumeratedValue><enumeratedValue><name>TwosComplement</name><description>2&#8217;s complement representation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>Companding mode. These bits are set and
              cleared by software. The -Law and the A-Law log are a
              part of the CCITT G.711 recommendation, the type of
              complement that will be used depends on CPL bit. The
              data expansion or data compression are determined by
              the state of bit MODE[0]. The data compression is
              applied if the audio block is configured as a
              transmitter. The data expansion is automatically
              applied when the audio block is configured as a
              receiver. Refer to Section: Companding mode for more
              details. Note: Companding mode is applicable only
              when TDM is selected.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>COMP</name><usage>read-write</usage><enumeratedValue><name>NoCompanding</name><description>No companding algorithm</description><value>0</value></enumeratedValue><enumeratedValue><name>MuLaw</name><description>&#956;-Law algorithm</description><value>2</value></enumeratedValue><enumeratedValue><name>ALaw</name><description>A-Law algorithm</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
