tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register>
          <name>SR</name>
          <displayName>ASR</displayName>
          <description>Status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>Overrun / underrun. This bit is read
              only. The overrun and underrun conditions can occur
              only when the audio block is configured as a receiver
              and a transmitter, respectively. It can generate an
              interrupt if OVRUDRIE bit is set in SAI_xIM register.
              This flag is cleared when the software sets COVRUDR
              bit in SAI_xCLRFR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRUDRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No overrun/underrun error</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun/underrun error detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>Mute detection. This bit is read only.
              This flag is set if consecutive 0 values are received
              in each slot of a given audio frame and for a
              consecutive number of audio frames (set in the
              MUTECNT bit in the SAI_xCR2 register). It can
              generate an interrupt if MUTEDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets bit CMUTEDET in the SAI_xCLRFR
              register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTEDETR</name><usage>read</usage><enumeratedValue><name>NoMute</name><description>No MUTE detection on the SD input line</description><value>0</value></enumeratedValue><enumeratedValue><name>Mute</name><description>MUTE value detected on the SD input line (0 value) for a specified number of consecutive audio frame</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>Wrong clock configuration flag. This bit
              is read only. This bit is used only when the audio
              block operates in master mode (MODE[1] = 0) and NODIV
              = 0. It can generate an interrupt if WCKCFGIE bit is
              set in SAI_xIM register. This flag is cleared when
              the software sets CWCKCFG bit in SAI_xCLRFR
              register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WCKCFGR</name><usage>read</usage><enumeratedValue><name>Correct</name><description>Clock configuration is correct</description><value>0</value></enumeratedValue><enumeratedValue><name>Wrong</name><description>Clock configuration does not respect the rule concerning the frame length specification</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO request. This bit is read only. The
              request depends on the audio block configuration: If
              the block is configured in transmission mode, the
              FIFO request is related to a write request operation
              in the SAI_xDR. If the block configured in reception,
              the FIFO request related to a read request operation
              from the SAI_xDR. This flag can generate an interrupt
              if FREQIE bit is set in SAI_xIM
              register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FREQR</name><usage>read</usage><enumeratedValue><name>NoRequest</name><description>No FIFO request</description><value>0</value></enumeratedValue><enumeratedValue><name>Request</name><description>FIFO request to read or to write the SAI_xDR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CNRDY</name>
              <description>Codec not ready. This bit is read only.
              This bit is used only when the AC97 audio protocol is
              selected in the SAI_xCR1 register and configured in
              receiver mode. It can generate an interrupt if
              CNRDYIE bit is set in SAI_xIM register. This flag is
              cleared when the software sets CCNRDY bit in
              SAI_xCLRFR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CNRDYR</name><usage>read</usage><enumeratedValue><name>Ready</name><description>External AC&#8217;97 Codec is ready</description><value>0</value></enumeratedValue><enumeratedValue><name>NotReady</name><description>External AC&#8217;97 Codec is not ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AFSDET</name>
              <description>Anticipated frame synchronization
              detection. This bit is read only. This flag can be
              set only if the audio block is configured in slave
              mode. It is not used in AC97or SPDIF mode. It can
              generate an interrupt if AFSDETIE bit is set in
              SAI_xIM register. This flag is cleared when the
              software sets CAFSDET bit in SAI_xCLRFR
              register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>EarlySync</name><description>Frame synchronization signal is detected earlier than expected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LFSDET</name>
              <description>Late frame synchronization detection.
              This bit is read only. This flag can be set only if
              the audio block is configured in slave mode. It is
              not used in AC97 or SPDIF mode. It can generate an
              interrupt if LFSDETIE bit is set in the SAI_xIM
              register. This flag is cleared when the software sets
              bit CLFSDET in SAI_xCLRFR register</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>NoSync</name><description>Frame synchronization signal is not present at the right time</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO level threshold. This bit is read
              only. The FIFO level threshold flag is managed only
              by hardware and its setting depends on SAI block
              configuration (transmitter or receiver mode). If the
              SAI block is configured as transmitter: If SAI block
              is configured as receiver:</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>FLVLR</name><usage>read</usage><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter1</name><description>FIFO &lt;= 1&#8260;4 but not empty</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1&#8260;4 &lt; FIFO &lt;= 1&#8260;2</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>1&#8260;2 &lt; FIFO &lt;= 3&#8260;4</description><value>3</value></enumeratedValue><enumeratedValue><name>Quarter4</name><description>3&#8260;4 &lt; FIFO but not full</description><value>4</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO full</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <displayName>ACLRFR</displayName>
          <description>Clear flag register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>Clear overrun / underrun. This bit is
              write only. Programming this bit to 1 clears the
              OVRUDR flag in the SAI_xSR register. Reading this bit
              always returns the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COVRUDRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the OVRUDR flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>Mute detection flag. This bit is write
              only. Programming this bit to 1 clears the MUTEDET
              flag in the SAI_xSR register. Reading this bit always
              returns the value 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMUTEDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the MUTEDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>Clear wrong clock configuration flag.
              This bit is write only. Programming this bit to 1
              clears the WCKCFG flag in the SAI_xSR register. This
              bit is used only when the audio block is set as
              master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1
              register. Reading this bit always returns the value
              0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CWCKCFGW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the WCKCFG flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>Clear Codec not ready flag. This bit is
              write only. Programming this bit to 1 clears the
              CNRDY flag in the SAI_xSR register. This bit is used
              only when the AC97 audio protocol is selected in the
              SAI_xCR1 register. Reading this bit always returns
              the value 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCNRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the CNRDY flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>Clear anticipated frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the AFSDET flag in the SAI_xSR
              register. It is not used in AC97or SPDIF mode.
              Reading this bit always returns the value
              0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CAFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the AFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>Clear late frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the LFSDET flag in the SAI_xSR
              register. This bit is not used in AC97or SPDIF mode
              Reading this bit always returns the value
              0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the LFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>ADR</displayName>
          <description>Data register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data A write to this register loads the
              FIFO provided the FIFO is not full. A read from this
              register empties the FIFO if the FIFO is not
              empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
