tinygo-org/stm32-svd/svd/stm32h747cm7.svd
        <register><name>ISR0</name><description>DSI Host interrupt and status register 0</description><addressOffset>188</addressOffset><resetValue>0</resetValue><fields><field><name>PE4</name><description>PHY error 4</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE3</name><description>PHY error 3</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE2</name><description>PHY error 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE1</name><description>PHY error 1</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE0</name><description>PHY error 0</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE15</name><description>Acknowledge error 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE14</name><description>Acknowledge error 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE13</name><description>Acknowledge error 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE12</name><description>Acknowledge error 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE11</name><description>Acknowledge error 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE10</name><description>Acknowledge error 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE9</name><description>Acknowledge error 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE8</name><description>Acknowledge error 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE7</name><description>Acknowledge error 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE6</name><description>Acknowledge error 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE5</name><description>Acknowledge error 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE4</name><description>Acknowledge error 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE3</name><description>Acknowledge error 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE2</name><description>Acknowledge error 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE1</name><description>Acknowledge error 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE0</name><description>Acknowledge error 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>ISR1</name><description>DSI Host interrupt and status register 1</description><addressOffset>192</addressOffset><resetValue>0</resetValue><fields><field><name>GPRXE</name><description>Generic payload receive error</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPRDE</name><description>Generic payload read error</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPTXE</name><description>Generic payload transmit error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPWRE</name><description>Generic payload write error</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GCWRE</name><description>Generic command write error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPWRE</name><description>LTDC payload write error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EOTPE</name><description>EoTp error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSE</name><description>Packet size error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRCE</name><description>CRC error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ECCME</name><description>ECC multi</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ECCSE</name><description>ECC single</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TOLPRX</name><description>Timeout low</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TOHSTX</name><description>Timeout high</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>IER0</name><description>DSI Host interrupt enable register 0</description><addressOffset>196</addressOffset><resetValue>0</resetValue><fields><field><name>PE4IE</name><description>PHY error 4 interrupt enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE3IE</name><description>PHY error 3 interrupt enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE2IE</name><description>PHY error 2 interrupt enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE1IE</name><description>PHY error 1 interrupt enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PE0IE</name><description>PHY error 0 interrupt enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE15IE</name><description>Acknowledge error 15 interrupt enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE14IE</name><description>Acknowledge error 14 interrupt enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE13IE</name><description>Acknowledge error 13 interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE12IE</name><description>Acknowledge error 12 interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE11IE</name><description>Acknowledge error 11 interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE10IE</name><description>Acknowledge error 10 interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE9IE</name><description>Acknowledge error 9 interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE8IE</name><description>Acknowledge error 8 interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE7IE</name><description>Acknowledge error 7 interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE6IE</name><description>Acknowledge error 6 interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE5IE</name><description>Acknowledge error 5 interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE4IE</name><description>Acknowledge error 4 interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE3IE</name><description>Acknowledge error 3 interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE2IE</name><description>Acknowledge error 2 interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE1IE</name><description>Acknowledge error 1 interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AE0IE</name><description>Acknowledge error 0 interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>IER1</name><description>DSI Host interrupt enable register 1</description><addressOffset>200</addressOffset><resetValue>0</resetValue><fields><field><name>GPRXEIE</name><description>Generic payload receive error interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPRDEIE</name><description>Generic payload read error interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPTXEIE</name><description>Generic payload transmit error interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GPWREIE</name><description>Generic payload write error interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>GCWREIE</name><description>Generic command write error interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPWREIE</name><description>LTDC payload write error interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EOTPEIE</name><description>EoTp error interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSEIE</name><description>Packet size error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRCEIE</name><description>CRC error interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ECCMEIE</name><description>ECC multi</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ECCSEIE</name><description>ECC single</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TOLPRXIE</name><description>Timeout low</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TOHSTXIE</name><description>Timeout high</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>FIR0</name><description>DSI Host force interrupt register 0</description><addressOffset>216</addressOffset><resetValue>0</resetValue><fields><field><name>FPE4</name><description>Force PHY error 4</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FPE3</name><description>Force PHY error 3</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FPE2</name><description>Force PHY error 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FPE1</name><description>Force PHY error 1</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FPE0</name><description>Force PHY error 0</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE15</name><description>Force acknowledge error 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE14</name><description>Force acknowledge error 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE13</name><description>Force acknowledge error 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE12</name><description>Force acknowledge error 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE11</name><description>Force acknowledge error 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE10</name><description>Force acknowledge error 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE9</name><description>Force acknowledge error 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE8</name><description>Force acknowledge error 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE7</name><description>Force acknowledge error 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE6</name><description>Force acknowledge error 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE5</name><description>Force acknowledge error 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE4</name><description>Force acknowledge error 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE3</name><description>Force acknowledge error 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE2</name><description>Force acknowledge error 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE1</name><description>Force acknowledge error 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FAE0</name><description>Force acknowledge error 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>FIR1</name><description>DSI Host force interrupt register 1</description><addressOffset>220</addressOffset><resetValue>0</resetValue><fields><field><name>FGPRXE</name><description>Force generic payload receive error</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FGPRDE</name><description>Force generic payload read error</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FGPTXE</name><description>Force generic payload transmit error</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FGPWRE</name><description>Force generic payload write error</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FGCWRE</name><description>Force generic command write error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FLPWRE</name><description>Force LTDC payload write error</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FEOTPE</name><description>Force EoTp error</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FPSE</name><description>Force packet size error</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FCRCE</name><description>Force CRC error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FECCME</name><description>Force ECC multi</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FECCSE</name><description>Force ECC single</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FTOLPRX</name><description>Force timeout low</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FTOHSTX</name><description>Force timeout high</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>VSCR</name><description>DSI Host video shadow control register</description><addressOffset>256</addressOffset><resetValue>0</resetValue><fields><field><name>UR</name><description>Update register</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EN</name><description>Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>LCVCIDR</name><description>DSI Host LTDC current VCID register</description><addressOffset>268</addressOffset><resetValue>0</resetValue><fields><field><name>VCID</name><description>Virtual channel ID</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>LCCCR</name><description>DSI Host LTDC current color coding register</description><addressOffset>272</addressOffset><resetValue>0</resetValue><fields><field><name>LPE</name><description>Loosely packed enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>COLC</name><description>Color coding</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field>
            </fields></register>
        <register><name>LPMCCR</name><description>DSI Host low-power mode current configuration register</description><addressOffset>280</addressOffset><resetValue>0</resetValue><fields><field><name>LPSIZE</name><description>Largest packet size</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>VLPSIZE</name><description>VACT largest packet size</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>VMCCR</name><description>DSI Host video mode current configuration register</description><addressOffset>312</addressOffset><resetValue>0</resetValue><fields><field><name>LPCE</name><description>Low-power command enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FBTAAE</name><description>Frame BTA acknowledge enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPHFE</name><description>Low-power horizontal front-porch enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPHBPE</name><description>Low-power horizontal back-porch enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVAE</name><description>Low-power vertical active enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVFPE</name><description>Low-power vertical front-porch enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVBPE</name><description>Low-power vertical back-porch enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPVSAE</name><description>Low-power vertical sync time enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>VMT</name><description>Video mode type</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>VPCCR</name><description>DSI Host video packet current configuration register</description><addressOffset>316</addressOffset><resetValue>0</resetValue><fields><field><name>VPSIZE</name><description>Video packet size</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field>
            </fields></register>
        <register><name>VCCCR</name><description>DSI Host video chunks current configuration register</description><addressOffset>320</addressOffset><resetValue>0</resetValue><fields><field><name>NUMC</name><description>Number of chunks</description><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field>
            </fields></register>
        <register><name>VNPCCR</name><description>DSI Host video null packet current configuration register</description><addressOffset>324</addressOffset><resetValue>0</resetValue><fields><field><name>NPSIZE</name><description>Null packet size</description><bitOffset>0</bitOffset><bitWidth>13</bitWidth></field>
            </fields></register>
        <register><name>VHSACCR</name><description>DSI Host video HSA current configuration register</description><addressOffset>328</addressOffset><resetValue>0</resetValue><fields><field><name>HSA</name><description>Horizontal synchronism active duration</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>VHBPCCR</name><description>DSI Host video HBP current configuration register</description><addressOffset>332</addressOffset><resetValue>0</resetValue><fields><field><name>HBP</name><description>Horizontal back</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>VLCCR</name><description>DSI Host video line current configuration register</description><addressOffset>336</addressOffset><resetValue>0</resetValue><fields><field><name>HLINE</name><description>Horizontal line duration</description><bitOffset>0</bitOffset><bitWidth>15</bitWidth></field>
            </fields></register>
        <register><name>VVSACCR</name><description>DSI Host video VSA current configuration register</description><addressOffset>340</addressOffset><resetValue>0</resetValue><fields><field><name>VSA</name><description>Vertical synchronism active duration</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVPBCCR</name><description>DSI Host video VBP current configuration register</description><addressOffset>344</addressOffset><resetValue>0</resetValue><fields><field><name>VBP</name><description>Vertical back</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVFPCCR</name><description>DSI Host video VFP current configuration register</description><addressOffset>348</addressOffset><resetValue>0</resetValue><fields><field><name>VFP</name><description>Vertical front</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field>
            </fields></register>
        <register><name>VVACCR</name><description>DSI Host video VA current configuration register</description><addressOffset>352</addressOffset><resetValue>0</resetValue><fields><field><name>VA</name><description>Vertical active duration</description><bitOffset>0</bitOffset><bitWidth>14</bitWidth></field>
            </fields></register>
        <register><name>WCFGR</name><description>DSI wrapper configuration register</description><addressOffset>1024</addressOffset><resetValue>0</resetValue><fields><field><name>VSPOL</name><description>VSync polarity</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AR</name><description>Automatic refresh</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TEPOL</name><description>TE polarity</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TESRC</name><description>TE source</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>COLMUX</name><description>Color multiplexing</description><bitOffset>1</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>DSIM</name><description>DSI mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>WCR</name><description>DSI wrapper control register</description><addressOffset>1028</addressOffset><resetValue>0</resetValue><fields><field><name>DSIEN</name><description>DSI enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LTDCEN</name><description>LTDC enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
