tinygo-org/stm32-svd/svd/stm32h747cm7.svd
            <field><name>SHTDN</name><description>Shutdown</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>COLM</name><description>Color mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>WIER</name><description>DSI wrapper interrupt enable register</description><addressOffset>1032</addressOffset><resetValue>0</resetValue><fields><field><name>RRIE</name><description>Regulator ready interrupt enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLUIE</name><description>PLL unlock interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLLIE</name><description>PLL lock interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ERIE</name><description>End of refresh interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TEIE</name><description>Tearing effect interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>WISR</name><description>DSI wrapper interrupt and status register</description><addressOffset>1036</addressOffset><resetValue>0</resetValue><fields><field><name>RRIF</name><description>Regulator ready interrupt flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RRS</name><description>Regulator ready status</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLUIF</name><description>PLL unlock interrupt flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLLIF</name><description>PLL lock interrupt flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PLLLS</name><description>PLL lock status</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BUSY</name><description>Busy flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ERIF</name><description>End of refresh interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TEIF</name><description>Tearing effect interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>WIFCR</name><description>DSI wrapper interrupt flag clear register</description><addressOffset>1040</addressOffset><resetValue>0</resetValue><fields><field><name>CRRIF</name><description>Clear regulator ready interrupt flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CPLLUIF</name><description>Clear PLL unlock interrupt flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CPLLLIF</name><description>Clear PLL lock interrupt flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CERIF</name><description>Clear end of refresh interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CTEIF</name><description>Clear tearing effect interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>WPCR0</name><description>DSI wrapper PHY configuration register 0</description><addressOffset>1048</addressOffset><resetValue>0</resetValue><fields><field><name>TCLKPOSTEN</name><description>Custom time for tCLK</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TLPXCEN</name><description>Custom time for tLPX for clock lane enable</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THSEXITEN</name><description>Custom time for tHS</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TLPXDEN</name><description>Custom time for tLPX for data lanes enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THSZEROEN</name><description>Custom time for tHS</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THSTRAILEN</name><description>Custom time for tHS</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>THSPREPEN</name><description>Custom time for tHS</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TCLKZEROEN</name><description>Custom time for tCLK</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TCLKPREPEN</name><description>Custom time for tCLK</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PDEN</name><description>Pull-down enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TDDL</name><description>Turn disable data lanes</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CDOFFDL</name><description>Contention detection OFF on data lanes</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FTXSMDL</name><description>Force in TX Stop mode the data lanes</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FTXSMCL</name><description>Force in TX Stop mode the clock lane</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSIDL1</name><description>Invert the high-speed data signal on data lane 1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSIDL0</name><description>Invert the high-speed data signal on data lane 0</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSICL</name><description>Invert high</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SWDL1</name><description>Swap data lane 1 pins</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SWDL0</name><description>Swap data lane 0 pins</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SWCL</name><description>Swap clock lane pins</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>UIX4</name><description>Unit interval multiplied by 4</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field>
            </fields></register>
        <register><name>WPCR1</name><description>DSI wrapper PHY configuration register 1</description><addressOffset>1052</addressOffset><resetValue>0</resetValue><fields><field><name>LPRXFT</name><description>Low-power RX low-pass filtering tuning</description><bitOffset>25</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>FLPRXLPM</name><description>Forces LP receiver in low-power mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HSTXSRCDL</name><description>High-speed transmission slew-rate control on data lanes</description><bitOffset>18</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>HSTXSRCCL</name><description>High-speed transmission slew-rate control on clock lane</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>SDDC</name><description>SDD control</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LPSRCDL</name><description>Low-power transmission slew-rate compensation on data lanes</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>LPSRCCL</name><description>Low-power transmission slew-rate compensation on clock lane</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>HSTXDDL</name><description>High-speed transmission delay on data lanes</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>HSTXDCL</name><description>High-speed transmission delay on clock lane</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field>
            </fields></register>
        <register><name>WPCR2</name><description>DSI wrapper PHY configuration register 2</description><addressOffset>1056</addressOffset><resetValue>0</resetValue><fields><field><name>THSTRAIL</name><description>tHSTRAIL</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>THSPREP</name><description>tHS-PREPARE</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TCLKZERO</name><description>tCLK-ZERO</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TCLKPREP</name><description>tCLK-PREPARE</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>WPCR3</name><description>DSI wrapper PHY configuration register 3</description><addressOffset>1060</addressOffset><resetValue>0</resetValue><fields><field><name>TLPXC</name><description>tLPXC for clock lane</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>THSEXIT</name><description>tHSEXIT</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>TLPXD</name><description>tLPX for data lanes</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field>
            <field><name>THSZERO</name><description>tHS-ZERO</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>WPCR4</name><description>DSI wrapper PHY configuration register 4</description><addressOffset>1064</addressOffset><resetValue>0</resetValue><fields><field><name>TCLKPOST</name><description>tCLK-POST</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>WRPCR</name><description>DSI wrapper regulator and PLL control register</description><addressOffset>1072</addressOffset><resetValue>0</resetValue><fields><field><name>REGEN</name><description>Regulator enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>ODF</name><description>PLL output division factor</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>IDF</name><description>PLL input division factor</description><bitOffset>11</bitOffset><bitWidth>4</bitWidth></field>
            <field><name>NDIV</name><description>PLL loop division factor</description><bitOffset>2</bitOffset><bitWidth>7</bitWidth></field>
            <field><name>PLLEN</name><description>PLL enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        </registers></peripheral>
    <peripheral><name>FLASH</name><description>Embedded Flash Memory</description><groupName>FLASH</groupName><baseAddress>1375739904</baseAddress><addressBlock><offset>0</offset><size>512</size><usage>registers</usage></addressBlock><registers><cluster><dim>2</dim><dimIncrement>0x100</dimIncrement><dimIndex>1,2</dimIndex><name>BANK%s</name><description>Cluster BANK%s, containing KEYR?, CR?, SR?, CCR?, PRAR_CUR?, PRAR_PRG?, SCAR_CUR?, SCAR_PRG?, WPSN_CUR?R, WPSN_PRG?R, CRCCR?, CRCSADD?R, CRCEADD?R, ECC_FA?R</description><addressOffset>0x4</addressOffset><register><name>KEYR</name><description>FLASH key register for bank 1</description><addressOffset>0x0</addressOffset><access>write-only</access><resetValue>0</resetValue><fields><field><name>KEYR</name><description>Bank access configuration unlock key</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field>
            </fields></register>
        <register><name>CR</name><description>FLASH control register for bank 1</description><addressOffset>0x8</addressOffset><resetValue>49</resetValue><fields><field><name>CRCRDERRIE</name><description>Bank 1 CRC read error interrupt enable bit</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRCENDIE</name><description>Bank 1 CRC end of calculation interrupt enable bit</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DBECCERRIE</name><description>Bank 1 ECC double detection error interrupt enable bit</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SNECCERRIE</name><description>Bank 1 ECC single correction error interrupt enable bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDSERRIE</name><description>Bank 1 secure error interrupt enable bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDPERRIE</name><description>Bank 1 read protection error interrupt enable bit</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPERRIE</name><description>Bank 1 write</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INCERRIE</name><description>Bank 1 inconsistency error interrupt enable bit</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>STRBERRIE</name><description>Bank 1 strobe error interrupt enable bit</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PGSERRIE</name><description>Bank 1 programming sequence error interrupt enable bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WRPERRIE</name><description>Bank 1 write protection error interrupt enable bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EOPIE</name><description>Bank 1 end-of-program interrupt control bit</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRC_EN</name><description>Bank 1 CRC control bit</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SNB</name><description>Bank 1 sector erase selection number</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field>
            <field><name>START</name><description>Bank 1 erase start control bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FW</name><description>Bank 1 write forcing control bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PSIZE</name><description>Bank 1 program size</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>BER</name><description>Bank 1 erase request</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SER</name><description>Bank 1 sector erase request</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PG</name><description>Bank 1 internal buffer control bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LOCK</name><description>Bank 1 configuration lock bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>SR</name><description>FLASH status register for bank 1</description><addressOffset>0xc</addressOffset><resetValue>0</resetValue><fields><field><name>CRCRDERR</name><description>Bank 1 CRC read error flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRCEND</name><description>Bank 1 CRC end of calculation flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>DBECCERR</name><description>Bank 1 ECC double detection error flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SNECCERR</name><description>Bank 1 single correction error flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDSERR</name><description>Bank 1 secure error flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RDPERR</name><description>Bank 1 read protection error flag</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>OPERR</name><description>Bank 1 write</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INCERR</name><description>Bank 1 inconsistency error flag</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>STRBERR</name><description>Bank 1 strobe error flag</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PGSERR</name><description>Bank 1 programming sequence error flag</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WRPERR</name><description>Bank 1 write protection error flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>EOP</name><description>Bank 1 end-of-program flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CRC_BUSY</name><description>Bank 1 CRC busy flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>QW</name><description>Bank 1 wait queue flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WBNE</name><description>Bank 1 write buffer not empty flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>BSY</name><description>Bank 1 busy flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>CCR</name><description>FLASH clear control register for bank 1</description><addressOffset>0x10</addressOffset><resetValue>0</resetValue><fields><field><name>CLR_CRCRDERR</name><description>Bank 1 CRCRDERR1 flag clear bit</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_CRCEND</name><description>Bank 1 CRCEND1 flag clear bit</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_DBECCERR</name><description>Bank 1 DBECCERR1 flag clear bit</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_SNECCERR</name><description>Bank 1 SNECCERR1 flag clear bit</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_RDSERR</name><description>Bank 1 RDSERR1 flag clear bit</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_RDPERR</name><description>Bank 1 RDPERR1 flag clear bit</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_OPERR</name><description>Bank 1 OPERR1 flag clear bit</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_INCERR</name><description>Bank 1 INCERR1 flag clear bit</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_STRBERR</name><description>Bank 1 STRBERR1 flag clear bit</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_PGSERR</name><description>Bank 1 PGSERR1 flag clear bit</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_WRPERR</name><description>Bank 1 WRPERR1 flag clear bit</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>CLR_EOP</name><description>Bank 1 EOP1 flag clear bit</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            </fields></register>
        <register><name>PRAR_CUR</name><description>FLASH protection address for bank 1</description><addressOffset>0x24</addressOffset><resetValue>0</resetValue><fields><field><name>DMEP</name><description>Bank 1 PCROP protected erase enable option status bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PROT_AREA_END</name><description>Bank 1 PCROP area end status bits</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>PROT_AREA_START</name><description>Bank 1 PCROP area start status bits</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>PRAR_PRG</name><description>FLASH protection address for bank 1</description><addressOffset>0x28</addressOffset><resetValue>0</resetValue><fields><field><name>DMEP</name><description>Bank 1 PCROP protected erase enable option configuration bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PROT_AREA_END</name><description>Bank 1 PCROP area end configuration bits</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>PROT_AREA_START</name><description>Bank 1 PCROP area start configuration bits</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>SCAR_CUR</name><description>FLASH secure address for bank 1</description><addressOffset>0x2c</addressOffset><resetValue>0</resetValue><fields><field><name>DMES</name><description>Bank 1 secure access protected erase enable option status bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SEC_AREA_END</name><description>Bank 1 secure-only area end status bits</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>SEC_AREA_START</name><description>Bank 1 secure-only area start status bits</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>SCAR_PRG</name><description>FLASH secure address for bank 1</description><addressOffset>0x30</addressOffset><resetValue>0</resetValue><fields><field><name>DMES</name><description>Bank 1 secure access protected erase enable option configuration bit</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>SEC_AREA_END</name><description>Bank 1 secure-only area end configuration bits</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field>
            <field><name>SEC_AREA_START</name><description>Bank 1 secure-only area start configuration bits</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field>
            </fields></register>
        <register><name>WPSN_CURR</name><description>FLASH write sector protection for bank 1</description><addressOffset>0x34</addressOffset><resetValue>0</resetValue><fields><field><name>WRPSn</name><description>Bank 1 sector write protection option status byte</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
        <register><name>WPSN_PRGR</name><description>FLASH write sector protection for bank 1</description><addressOffset>0x38</addressOffset><resetValue>0</resetValue><fields><field><name>WRPSn</name><description>Bank 1 sector write protection option status byte</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field>
            </fields></register>
